In [1]:
import pandas as pd

In [2]:
data= pd.read_excel("C:/Users/TRISHA ROY/Downloads/P1-Airline-Comparison.xlsx")

In [3]:
data

    Period         Region    Revenue
0   FY2015         Africa   10000000
1   FY2015           Asia   20000000
2   FY2015      Australia   70000000
3   FY2015         Europe  120000000
4   FY2015  North America  150000000
5   FY2015  South America   60000000
6   FY2016         Africa    8000000
7   FY2016           Asia   16000000
8   FY2016      Australia   56000000
9   FY2016         Europe   96000000
10  FY2016  North America  120000000
11  FY2016  South America   48000000

### Q1. List any five functions of the pandas library with execution.

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Period   12 non-null     object
 1   Region   12 non-null     object
 2   Revenue  12 non-null     int64
dtypes: int64(1), object(2)
memory usage: 416.0+ bytes

In [7]:
data.iloc[0:4,0:2]

   Period     Region
0  FY2015     Africa
1  FY2015       Asia
2  FY2015  Australia
3  FY2015     Europe

In [8]:
data.describe()

            Revenue
count  1.200000e+01
mean   6.450000e+07
std    4.800852e+07
min    8.000000e+06
25%    1.900000e+07
50%    5.800000e+07
75%    1.020000e+08
max    1.500000e+08

In [12]:
data.groupby('Region').agg({'Revenue':'mean'})

                   Revenue
Region
Africa           9000000.0
Asia            18000000.0
Australia       63000000.0
Europe         108000000.0
North America  135000000.0
South America   54000000.0

In [16]:
data.isnull().sum()

Period     0
Region     0
Revenue    0
dtype: int64

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [18]:
df1=pd.DataFrame({"A":[1,2,3],
                 "B":[4,5,6],
                 "C":[7,8,9]})
pd.DataFrame(df1,index= range(1,2*len(df1)+1,2))

     A    B    C
1  2.0  5.0  8.0
3  NaN  NaN  NaN
5  NaN  NaN  NaN

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [21]:
df2=pd.DataFrame({"Values":[23,56,78,90,45,63,13]})
df2[0:3].sum()

Values    157
dtype: int64

In [61]:
df3=pd.DataFrame({"Text":["List any five functions of the pandas library with execution.","Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.","You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console."]})
df3['words']=df3['Text'].apply(lambda x: len(x.split(' ')))

In [59]:
df3

                                                Text  words
0  List any five functions of the pandas library ...     10
1  Given a Pandas DataFrame df with columns 'A', ...     34
2  You have a Pandas DataFrame df with a column n...     42

### Q5. How are DataFrame.size() and DataFrame.shape() different?

size represents the total number of **elements** whereas shape represents the no. of **rows** and **columns** in the form of tupple

In [67]:
df3.size

6

In [68]:
df3.shape

(3, 2)

### Q6. Which function of pandas do we use to read an excel file?

we use pd.read_excel("path") to read an excel file

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [69]:
df=pd.DataFrame({"Email":['trisharoy@gmail.com',"Kevinroy@gmail.com","ruchikasingh45@gmail.com","gokulnair@yahoo.com"]})
df['username']=df['Email'].apply(lambda x: x.split('@')[0])

In [70]:
df

                      Email        username
0       trisharoy@gmail.com       trisharoy
1        Kevinroy@gmail.com        Kevinroy
2  ruchikasingh45@gmail.com  ruchikasingh45
3       gokulnair@yahoo.com       gokulnair

###  Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [74]:
df=pd.DataFrame({"A":[3,8,6,2,9],
                "B":[5,2,9,3,1],
                "C":[1,7,4,5,2]})
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [75]:
df2=pd.DataFrame({"Values":[23,56,78,90,45,63,13]})
df2['Values'].mean()

52.57142857142857

In [76]:
df2['Values'].median()

56.0

In [77]:
df2['Values'].std()

27.88582162352488

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [81]:
Sales=[250,340,567,987,654,31,287,934,674,3452,987,809,643,234,567,890,978,867,756,645,534,432]
date=pd.date_range(start='2023-01-01',end='2023-01-22')

In [82]:
df=pd.DataFrame({"Sales":Sales,
   "Date":date})
df

    Sales       Date
0     250 2023-01-01
1     340 2023-01-02
2     567 2023-01-03
3     987 2023-01-04
4     654 2023-01-05
5      31 2023-01-06
6     287 2023-01-07
7     934 2023-01-08
8     674 2023-01-09
9    3452 2023-01-10
10    987 2023-01-11
11    809 2023-01-12
12    643 2023-01-13
13    234 2023-01-14
14    567 2023-01-15
15    890 2023-01-16
16    978 2023-01-17
17    867 2023-01-18
18    756 2023-01-19
19    645 2023-01-20
20    534 2023-01-21
21    432 2023-01-22

In [87]:
df['Sales'].rolling(window=7).mean()

0             NaN
1             NaN
2             NaN
3             NaN
4             NaN
5             NaN
6      445.142857
7      542.857143
8      590.571429
9     1002.714286
10    1002.714286
11    1024.857143
12    1112.285714
13    1104.714286
14    1052.285714
15    1083.142857
16     729.714286
17     712.571429
18     705.000000
19     705.285714
20     748.142857
21     728.857143
Name: Sales, dtype: float64

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [91]:
df['Weekday']=df['Date'].dt.day_name()

In [92]:
df

    Sales       Date    Weekday
0     250 2023-01-01     Sunday
1     340 2023-01-02     Monday
2     567 2023-01-03    Tuesday
3     987 2023-01-04  Wednesday
4     654 2023-01-05   Thursday
5      31 2023-01-06     Friday
6     287 2023-01-07   Saturday
7     934 2023-01-08     Sunday
8     674 2023-01-09     Monday
9    3452 2023-01-10    Tuesday
10    987 2023-01-11  Wednesday
11    809 2023-01-12   Thursday
12    643 2023-01-13     Friday
13    234 2023-01-14   Saturday
14    567 2023-01-15     Sunday
15    890 2023-01-16     Monday
16    978 2023-01-17    Tuesday
17    867 2023-01-18  Wednesday
18    756 2023-01-19   Thursday
19    645 2023-01-20     Friday
20    534 2023-01-21   Saturday
21    432 2023-01-22     Sunday

In [97]:
df[(df['Date']>='2023-01-01') & (df['Date']<='2023-01-31')]

    Sales       Date    Weekday
0     250 2023-01-01     Sunday
1     340 2023-01-02     Monday
2     567 2023-01-03    Tuesday
3     987 2023-01-04  Wednesday
4     654 2023-01-05   Thursday
5      31 2023-01-06     Friday
6     287 2023-01-07   Saturday
7     934 2023-01-08     Sunday
8     674 2023-01-09     Monday
9    3452 2023-01-10    Tuesday
10    987 2023-01-11  Wednesday
11    809 2023-01-12   Thursday
12    643 2023-01-13     Friday
13    234 2023-01-14   Saturday
14    567 2023-01-15     Sunday
15    890 2023-01-16     Monday
16    978 2023-01-17    Tuesday
17    867 2023-01-18  Wednesday
18    756 2023-01-19   Thursday
19    645 2023-01-20     Friday
20    534 2023-01-21   Saturday
21    432 2023-01-22     Sunday

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

import pandas as pd